Enums/ВидыОперацийПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПриходнаяНакладная</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаОтветхранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСОтветхранения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ITF_Доработки/Ext/Module.bsl
Процедура ITF_ДвиженияДополнительныеДанныеПоСериямОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходнаяНакладная") 
		И (Источник.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера
		Или Источник.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика
        Или Источник.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя
        Или Источник.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратСОтветхранения)
		Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяСерийныеНомера.Ссылка КАК Ссылка,
		|	ПриходнаяНакладнаяСерийныеНомера.СерийныйНомер,
		|	ПриходнаяНакладнаяСерийныеНомера.КлючСвязи КАК КлючСвязи
		|ПОМЕСТИТЬ ВС_СерийныеНомера
		|ИЗ
		|	Документ.ПриходнаяНакладная.СерийныеНомера КАК ПриходнаяНакладнаяСерийныеНомера
		|ГДЕ
		|	ПриходнаяНакладнаяСерийныеНомера.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	КлючСвязи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходнаяНакладнаяЗапасы.Ссылка КАК Ссылка,
		|	ПриходнаяНакладнаяЗапасы.Номенклатура,
		|	ПриходнаяНакладнаяЗапасы.ITF_ЕстьИзменениеЦены,
		|	ПриходнаяНакладнаяЗапасы.ITF_ЦенаЕвро,
		|	ПриходнаяНакладнаяЗапасы.КлючСвязи КАК КлючСвязи
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		|ГДЕ
		|	ПриходнаяНакладнаяЗапасы.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	КлючСвязи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВС_СерийныеНомера.Ссылка.Дата,
		|	ВС_СерийныеНомера.Ссылка,
		|	ВС_СерийныеНомера.СерийныйНомер,
		|	ВС_СерийныеНомера.КлючСвязи,
		|	ВТ_Запасы.Номенклатура,
		|	ВТ_Запасы.ITF_ЕстьИзменениеЦены,
		|	ВТ_Запасы.ITF_ЦенаЕвро
		|ИЗ
		|	ВС_СерийныеНомера КАК ВС_СерийныеНомера
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Запасы КАК ВТ_Запасы
		|		ПО ВС_СерийныеНомера.Ссылка = ВТ_Запасы.Ссылка
		|			И ВС_СерийныеНомера.КлючСвязи = ВТ_Запасы.КлючСвязи";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ITF_ЕстьИзменениеЦены)
			Или ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ITF_ЦенаЕвро) Тогда
		Запись = Источник.Движения.ITF_ДополнительныеДанныеПоСериям.Добавить();
		Запись.Период 		= ВыборкаДетальныеЗаписи.СсылкаДата;
		Запись.Регистратор 	= ВыборкаДетальныеЗаписи.Ссылка;
		Запись.СерийныйНомер = ВыборкаДетальныеЗаписи.СерийныйНомер;
		Запись.ITF_ЕстьИзменениеЦены = ВыборкаДетальныеЗаписи.ITF_ЕстьИзменениеЦены;
		Запись.ITF_ЦенаЕвро = ВыборкаДетальныеЗаписи.ITF_ЦенаЕвро;  
		КонецЕсли;
		
	КонецЦикла;
	Источник.Движения.ITF_ДополнительныеДанныеПоСериям.Записать(Истина);
	

КонецПроцедуры
